In [2]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder, StandardScaler

In [6]:
data = pd.read_csv(r"C:\Users\LELETI\Desktop\data set\insurance.csv")
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [7]:
data.drop(['region'], axis = 1, inplace = True)
data.head()

   age     sex     bmi  children smoker      charges
0   19  female  27.900         0    yes  16884.92400
1   18    male  33.770         1     no   1725.55230
2   28    male  33.000         3     no   4449.46200
3   33    male  22.705         0     no  21984.47061
4   32    male  28.880         0     no   3866.85520

In [13]:
encoder = LabelEncoder()
data['sex'] = encoder.fit_transform(data['sex'])
data['smoker'] = encoder.fit_transform(data['smoker'])
data.head()

   age  sex     bmi  children  smoker      charges
0   19    0  27.900         0       1  16884.92400
1   18    1  33.770         1       0   1725.55230
2   28    1  33.000         3       0   4449.46200
3   33    1  22.705         0       0  21984.47061
4   32    1  28.880         0       0   3866.85520

In [16]:
data.fillna(data.mean(),inplace=True)

In [17]:
scaler = StandardScaler()
data[['age','sex','bmi','smoker','charges']]= scaler.fit_transform(data[['age','sex','bmi','smoker','charges']])

In [18]:
from sklearn.model_selection import train_test_split

In [22]:
x_train,x_test,y_train,y_test = train_test_split(data.drop('bmi',axis=1),data['bmi'], test_size=0.3, random_state =42)

In [25]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier

In [26]:
tree_model = DecisionTreeClassifier(random_state=42)
tree_model.fit